## Plan Result (prod-enterprise)




<pre><code>Plan: 69 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform System Integration Testing&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
* Update
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_service_principal.sp




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["CRIME-ADO-POC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6b2c4a37-044e-4f83-9bd6-c8181f81f4dd"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/ef8dd153-3fba-47a4-be65-15775bcde240"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ff5ea8a7-a509-4f4a-ad85-9e27d5aa81e1"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "28bc2a45-9313-445b-a09c-2a6f31132d14"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/ddd45636-d58a-437f-8ad8-99b0add0092b"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFT-Sandbox"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2e6ff9f6-d09c-4033-b374-24c04660487e"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFT-VH-Pilot"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6c12b0ed-9996-47f3-8902-0c9046fac4b4"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/4bb049c8-33f3-4860-91b4-9ee45375cc18"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-DEMO"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e0c910b7-cab0-4066-8299-0754a3ca6a17"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-DEV"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d5e3ba53-7eef-495b-8e95-abce4056f40a"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-ITHC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ac2dc06b-61e8-4ebe-ac14-c680724944f3"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "44c2562a-c42f-44ad-baed-6d756e552421"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "13b7591b-6a22-41f7-aeb4-89926785c0ce"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-STG"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "890ccf59-f9e5-4758-a392-2c03e4fdaeb5"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-TEST"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "02ea7c69-56e5-4e48-83eb-5cc721dfb432"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPSDATA-DEMO"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6cdfafb8-0cc7-4f85-8758-c055da3ae2ec"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/dbd3a97b-580e-4ecb-9ed3-4e86f6f23d25"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "847b4c4a-6bdf-4e35-b8f3-dc6a81b89d57"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CNP-Prod"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cfd53954-7782-4aae-b100-8108eb8f6094"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CNP-QA"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "279ff279-b495-48da-ad6d-e43d9ba38191"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-MI-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7e128cf2-6ab5-488b-8128-634ed5ac4c18"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-RDO-Development"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "29624f48-a0ac-42cc-b7d4-3551d987adb9"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/fa397675-6ddf-4cb0-b1fc-bc7df0e51bf4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-RDO-Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a8417a04-42fb-4019-8976-094376df09f4"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/00b9a00a-20eb-4173-b7b6-468e00836a33"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-ROBOTICS-DEV"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "486a3048-3e66-4b76-8371-b7d0d2b3f1ab"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/6fe2c66c-ef6f-4064-9ced-95ac3fb8966f"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-ROBOTICS-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e36533dc-2be3-420a-9a5f-882560063019"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/cdc31e8e-43f4-4c8a-8b50-635e954c27d3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ARCHIVING-PROD"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3d15a4dc-9f5b-45f5-ac72-ad9d391d5bda"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/61432c17-4377-4780-be02-d56e56ef2b07"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b40cd6f9-4d97-4b07-a6d7-fab86c92c0d4"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/cad00ede-36df-4e04-ad0b-d34a1e94ef76"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-CFTPTL-INTSVC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e758ec9b-b7e9-46c1-98e1-f552405a2802"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "62b7e5c7-08ed-45bd-b0c8-66477ad66101"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-DACS-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0de57576-622c-4663-b241-b21aea4d921d"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/1fe7db01-9981-4ed3-983c-163dd50ba43a"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-HERITAGE-EXTSVC-PROD"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e278f3b7-fa0a-43ad-aa43-993a4b7c5c2f"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/c170c61a-f00f-4295-a718-634e27af1597"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-HERITAGE-EXTSVC-STG"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2cce90dd-f3ce-4809-b1da-2edd1ee5dcf5"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/9c604868-4643-43b8-9eb1-4c348c739a3e"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-HERITAGE-INTSVC-PROD"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "60c6a91c-54f7-4f71-9124-74d4a8258634"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-HERITAGE-INTSVC-STG"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "13c9d818-de9f-41ad-b4ea-198bac10129b"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "707883b0-3f2b-481c-aac5-3ca9c4580bb2"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-MANAGEMENT-PROD-INTSVC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2fe57110-fa73-4fb2-a18a-1d4e7a844497"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "99e37c67-ca37-4922-9b32-f1db7b7acefe"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/5709598c-3a1c-4535-8979-f10948b9a031"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-MANAGEMENT-SBOX-INTSVC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "254825af-360a-4608-9b08-329bf14dc3d2"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/b3394340-6c9f-44ca-aa3e-9ff38bd1f9ac"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-MANAGEMENT-TEST"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e81586f1-cfa5-495d-91bc-2e4f3dc6c936"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/d7b54c7f-c2c9-41ee-930d-7056ebbb5bde"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICES-DEMO"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "285562b3-eb00-44cf-8573-04d4d18ad8c6"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICES-DEV"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "950f5f69-ab78-4d6c-b528-7c8836dc87e6"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICES-ITHC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "dbb31961-0c97-46d2-8d9b-3f3764b13d9f"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICES-PROD"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "64315656-88c8-4392-a15f-5bd437fef668"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICES-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "246f8c2e-f1bf-44d8-aa56-337d7c4c7c7b"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICES-STG"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "55fe4c96-2ed9-443a-b6e7-03d2cb20f790"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICES-TEST"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "23924ac8-2308-4e73-8c5a-4853c9470580"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICESPTL"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "958c86ad-1e0c-46a0-87af-a5ddf65acf60"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-SHAREDSERVICESPTL-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "22e68583-d33f-41c9-8de0-367c3e02d504"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["HMCTS-CONTROL"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d1240eb4-a2c4-43cf-8bb7-062cf7dd8b6e"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["HMCTS-HUB-DEV"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fd63b66f-6c40-4b4f-9aef-bc2f79097fcb"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/b50cfb90-d6cd-4e78-97e6-cb7958335b6e"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["HMCTS-HUB-NONPROD-INTSVC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "44014b51-3065-41ec-8d34-84e0ab6cff39"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["HMCTS-HUB-PROD-INTSVC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e9c76820-cfbb-4b26-8774-65207690fa90"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["HMCTS-HUB-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1b69b064-2389-411c-a345-6983ce824f7e"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["HMCTS-HUB-SBOX-INTSVC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f2c0b687-874e-4d8f-908d-deb31e3db115"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["HMCTS-HUB-TEST"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5b1b97bc-c5dd-4b1d-932e-24621fd059ea"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/ba3c6fcf-22b1-4a11-9080-1cf965c060e9"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["HMCTS-SOC-PROD"].azuread_service_principal.sp will be updated in-place
  ~ resource "azuread_service_principal" "sp" {
        id                           = "648f0570-28bd-4b0c-887d-85e6f91d7db8"
      ~ owners                       = [
          - "4543a096-a913-4550-8c8d-99fdb0a60881",
        ]
        tags                         = []
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.subscription["HMCTS-SOC-PROD"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1285d7a4-9cbf-4a05-a15c-4c08acc69370"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/8ae5b3b6-0b12-4888-b894-4cec33c92292"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3c2e1915-f50e-41d2-b10d-8c5202958af1"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["MOJ DCD Atlassian LVE"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4534cad8-da3b-4e04-abfb-f0823f029a8c"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["MOJ DCD Atlassian NLE"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fa93be0b-143a-4b32-bddc-81cd2c4499bc"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["MoJ Common Platform Non-Functional Testing"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "254b8593-9d19-4132-9997-421bf79f0989"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/274541e0-1d81-4466-82af-15cd40e86c96"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["MoJ Common Platform Non-Live Management"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9d69b84d-5fdb-4bdb-8c9b-e88f8b3e5424"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/66cfcc0b-d764-4c07-bbeb-0a74101dbcf3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["MoJ Common Platform Online Plea Pre-Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "18bd43ec-0475-44fa-af87-d960363a76b4"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/e854024f-5d34-4043-a7a7-cbf4bb6f4d67"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["MoJ Common Platform Online Plea Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9cbcdcd7-d9fa-4cd9-89b3-869e0e40544d"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/5ff94e9e-4276-4e4b-b36b-475101d613d4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["MoJ Common Platform Operational Services"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "594cb070-a962-4c65-ae1c-00d5a274bf5a"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/28d33a47-7c14-456d-9a40-ce9c9b5a3937"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["MoJ Common Platform Pilot"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "716d665d-a0f9-4c77-98d8-98ed2a4e7aff"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/4c335e3a-f3d5-41cb-91d5-f2816853a22a"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["MoJ Common Platform Pre-Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6116bec5-6a87-469a-ac94-67e83603d036"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/3d84f717-22a0-4f4e-aac7-5ff8f4ee0a90"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["MoJ Common Platform Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2b9fcb05-20ac-4ba4-a323-f56bbfc9e303"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/55c2f45e-1381-4b17-9bd0-f85215b8bb4f"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["MoJ Common Platform Security Operations"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f8a755d9-1632-4e7e-8914-b4ee6dd72425"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/c7d20737-15ae-45da-bec4-67da9c029ddc"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["MoJ Common Platform System Integration Testing"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fae90739-d1ff-44f4-bb2c-05cb5799e621"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/12ffc6f5-7035-41fc-b96a-846d8fedc94b"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["MoJ Operational Services Validation"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e76fe869-ce2f-46db-bd9d-f79bce5b7673"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/6491a35d-b1cc-4823-8340-0b847abc9a1b"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5cfbc1e7-241a-4729-9b16-089360ab3f54"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0a3a9204-8f79-403f-9917-5a19bc3ea045"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "94d21afe-5d3d-41a9-8262-067241c81d9d"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 69 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":73,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->